thanks for the information @jbristowe , now, with the new version I'm getting:


```
 % tf14 apply --target=octopusdeploy_listening_tentacle_deployment_target.target
octopusdeploy_environment.octopus: Refreshing state... [id=Environments-501]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # octopusdeploy_listening_tentacle_deployment_target.target will be created
  + resource "octopusdeploy_listening_tentacle_deployment_target" "target" {
      + certificate_signature_algorithm   = (known after apply)
      + environments                      = [
          + "xx",
        ]
      + has_latest_calamari               = (known after apply)
      + health_status                     = (known after apply)
      + id                                = (known after apply)
      + is_disabled                       = true
      + is_in_process                     = (known after apply)
      + machine_policy_id                 = (known after apply)
      + name                              = "sample-server"
      + operating_system                  = (known after apply)
      + proxy_id                          = (known after apply)
      + roles                             = [
          + "xx",
        ]
      + shell_name                        = (known after apply)
      + shell_version                     = (known after apply)
      + space_id                          = (known after apply)
      + status                            = (known after apply)
      + status_summary                    = (known after apply)
      + tenant_tags                       = (known after apply)
      + tenanted_deployment_participation = "Untenanted"
      + tentacle_url                      = "https://xxx:10933"
      + thumbprint                        = "xxx"
      + uri                               = (known after apply)

      + tentacle_version_details {
          + upgrade_locked    = (known after apply)
          + upgrade_required  = (known after apply)
          + upgrade_suggested = (known after apply)
          + version           = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


Warning: Resource targeting is in effect

You are creating a plan with the -target option, which means that the result
of this plan may not represent all of the changes requested by the current
configuration.

The -target option is not for routine use, and is provided only for
exceptional situations such as recovering from errors or mistakes, or when
Terraform specifically suggests to use it as part of an error message.

Do you want to perform these actions in workspace "we-prd"?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

octopusdeploy_listening_tentacle_deployment_target.target: Creating...

Warning: Applied changes may be incomplete

The plan was created with the -target option in effect, so some changes
requested in the configuration may have been ignored and the output values may
not be fully updated. Run the following command to verify that no other
changes are pending:
    terraform plan

Note that the -target option is not suitable for routine use, and is provided
only for exceptional situations such as recovering from errors or mistakes, or
when Terraform specifically suggests to use it as part of an error message.


Error: Octopus API error: Value cannot be null.
Parameter name: source [] Value cannot be null.
Parameter name: source
System.ArgumentNullException
   at System.Linq.Enumerable.Any[TSource](IEnumerable`1 source)
   at Octopus.Server.Web.Api.Rules.TenantsFiltersAndTenantedDeploymentParticipationAgreeRule.BeforeMap(IParticipateInTenantedDeployments model, IParticipateInTenantedDeployments resource, ISpecialRuleContext context)
   at Octopus.Server.Web.Infrastructure.Api.Responder`1.ExecuteRules[TRule](Action`2 ruleCallback)
   at Octopus.Server.Web.Infrastructure.Api.CreateResponseDescriptor`2.Responder.Execute()
   at Octopus.Server.Web.Infrastructure.Api.Responder`1.Respond(TDescriptor options, NancyContext context)
   at System.Dynamic.UpdateDelegates.UpdateAndExecute3[T0,T1,T2,TRet](CallSite site, T0 arg0, T1 arg1, T2 arg2)
   at Octopus.Server.Web.Infrastructure.OctopusNancyModule.<>c__DisplayClass14_0.<get_Routes>b__1(Object x)
   at Nancy.Routing.Route.<>c__DisplayClass4.<Wrap>b__3(Object parameters, CancellationToken context)

  on octopus.tf line 15, in resource "octopusdeploy_listening_tentacle_deployment_target" "target":
  15: resource "octopusdeploy_listening_tentacle_deployment_target" "target" {


Releasing state lock. This may take a few moments...
```

Code same as before expectthat im passing `environments = ["xx"]`